/*
Задание 4. 
Реализовать алгоритм перевода из инфиксной записи в постфиксную для арифметического выражения.
http://primat.org/news/obratnaja_polskaja_zapis/2016-04-09-1181 Вычислить запись если это возможно
Важно! Для вывода используем логгер и соблюдаем код-стайл!
 */
public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}